Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAnalysisProperties Class
 The AnalysisPartAnalysisProperties class contains information related to analysis part analysis properties.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Analysis.AnalysisPartAnalysisProperties
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class AnalysisPartAnalysisProperties
Public NotInheritable Class AnalysisPartAnalysisProperties
The AnalysisPartAnalysisProperties type exposes the following members.
Constructors
Name | Description
AnalysisPartAnalysisProperties
Initializes a new instance of the AnalysisPartAnalysisProperties class
Top
Properties
Name | Description
AnalysisClass
 The analysis class of the analysis part.
BuiltupMode
 The builtup mode of the analysis part.
DesignGroup
 The design group of the analysis part.
PhysicalFreezed
 Indicates whether the physical part has been freezed.
Top
See Also
Reference
Tekla.Structures.Analysis Namespace